Autodesk.Revit.DB.Structure.RebarSpliceShiftOption
Describes the way bars are shifted in the splice relation.
Since:
2025
Since:
2025

Autodesk.Revit.DB.Structure.RebarSpliceShiftOption.None
The bars are not shifted at all.

Autodesk.Revit.DB.Structure.RebarSpliceShiftOption.BarPlane
Bar Plane is shifted so that the spliced rebars are not clashing.